{
  "name": "Robert Todar",
  "title": "Software Developer",
  "location": "Phoenix, Arizona",
  "phone": "602 - 935 - 5076",
  "email": "robert@roberttodar.com",
  "website": "www.roberttodar.com",
  "github": "www.github.com/todar",
  "linkedin": "www.linkedin.com/in/robert-todar/",
  "skills": [
    "Advanced VBA",
    "SQL — DB2, Oracle",
    "Python",
    "JavaScript ES6+",
    "React.js",
    "NodeJS",
    "HTML5",
    "CSS3",
    "Git",
    "REST API",
    "JSON",
    "Github",
    "Microsoft Sharepoint",
    "Microsoft Power Automate",
    "Microsoft Power BI",
    "Advanced Microsoft Excel",
    "Data Analytics"
  ],
  "about": "An innovative, teachable, problem-solving software developer with over six years of experience. Have developed applications, tools, and reports that automate inefficient processes and increase insights and analysis into large data sets. Skilled in analyzing data and business processes — then implementing solutions that maximize effectiveness while maintaining data integrity. Highly knowledgeable and experienced with various tools and software languages, aiding in applying the best tool for each project.",
  "experience": [
     {
        "company": "Albertsons Companies",
        "logo": "Albertsons-50x50.png",
        "location": "Phoenix, Arizona",
        "startdate": "Dec 2015",
        "enddate": "Present",
        "positions": [
           {
              "title": "Digital Workforce Analyst II",
              "startdate": "Aug 2020",
              "enddate": "Present",
              "description": "A technical lead used primarily for aiding in Albertsons migration to Oracle Cloud Financials platform.",
              "highlights": [
                 "Designed key SQL reports in Oracle Cloud Financials that are used for tracking data integrity through the migration process.",
                 "Developed a Microsoft Power Automate flow that is used to do mass updates to invoice records within Oracle — using Oracle's REST API services.",
                 "Created a DevOps workflow for Python using GitHub actions that implemented  continuous integration/continuous deployment, which increased the reliability of production code, and improved deployment time.",
                 "Mentored junior developers, assisting them with code reviews, training them in coding best practices, and being a resource for brainstorming solutions for their tasks."
              ]
           },
           {
              "title": "Business Analyst",
              "startdate": "Dec 2015",
              "enddate": "Aug 2020",
              "description": "The lead software developer for internal auditing within product allowances.",
              "highlights": [
                 "Built a full-stack CRUD application that is used as the primary tool for data analysis and process automation. This application has aided in increasing overall audit findings by over 10% and saves over 46,000 labor hours annually.",
                 "Reviewed a key audit process and identified that a substantial amount of data was being missed by the audit. Implemented new SQL query designs that captured all missing data, resulting in a 60% increase of dollar findings for that audit.",
                 "Created and maintained over 30 production SQL queries that are critical to daily business requirements."
              ]
           }
        ]
     },
     {
        "company": "Saguaro Drywall",
        "location": "Phoenix, Arizona",
        "startdate": 2013,
        "enddate": 2015,
        "logo": "SaguaroLogo-50x50.PNG",
        "positions": [
           {
              "title": "Superintendent",
              "startdate": 2013,
              "enddate": 2015,
              "description": "Learned the business from the ground up. Started as a laborer, trained under the lead project manager for over a year, and advanced to become the lead superintendent in charge of drywall repairs.",
              "highlights": [
                 "Created a job scheduling application that tracked job site information and repairman coverage resulting in improved workflow for all upcoming and ongoing projects."
              ]
           }
        ]
     }
  ],
  "certifications": [
     {
        "name": "MSUS Cloud Skills Challenge Champion",
        "issuer": "Microsoft",
        "issued": "Feb 2021",
        "expires": "No Expiration Date",
        "credential": "78677b2b-4495-4324-a84b-eada4e7055f8",
        "logo": "microsoft.png"
     },
     {
        "name": "Modern JavaScript From The Beginning",
        "issuer": "Udemy",
        "issued": "Jul 2020",
        "expires": "No Expiration Date",
        "credential": "UC-428969d4-ac6c-4d87-a29a-04f860fe3aff",
        "logo": "udemy.jpg"
     },
     {
        "name": "Advanced RPA professional",
        "issuer": "Automation Anywhere",
        "issued": "Jul 2018",
        "expires": "No Expiration Date",
        "credential": "AAADVC-33265922",
        "logo": "automation-anywhere.png"
     }
  ],
  "titles": {
    "connect": "Connect",
    "skills": "Skills",
    "about": "About",
    "experience": "Work Experience",
    "education": "Certifications"
  },
  "createdNote": "*This resume was made using React"
}